UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_СопоставленныеСклады/рар_мп_СопоставленныеСклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_СопоставленныеСклады</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <attributes>
    <name>НазваниеСкладаНаМаркетплейсе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯМ_campaignId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d972e718-5f4e-4a7b-b409-d1e75554556c">
  <name>ТоварыОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="95917e0e-35ef-4c95-a947-ffa9978377dd">
    <name>КОформлениюСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="310a92c5-b08c-4e6d-bee8-e2c6478cb7de">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2c50f8fe-4f16-43c6-a3e9-4eeb322694df">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="986f4eab-39f0-402e-92a6-de77c517b6d2">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ee2253b1-ab42-48e3-9904-a2aee6d27c4d">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="aca20c25-c763-4dc8-909a-2cbf809a16f1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СхемыРаботы/рар_мп_СхемыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СхемыРаботы</name>
  <enumValues>
    <name>FBS</name>
  </enumValues>
  <enumValues>
    <name>FBO</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/РаспределениеЗапасовСостояния/РаспределениеЗапасовСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545815ed-aef9-41ce-93e4-8bbe4895c3db">
  <name>РаспределениеЗапасовСостояния</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="47d10a43-5556-4259-bde6-880106968b77">
    <name>ОстатокНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6ff498b5-7ab4-4383-9c48-6815070d7439">
    <name>ОжидаемоеПоступление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_ОбновлениеОстатков/Module.bsl
#Область ЯндексМаркет

Процедура ЯндексМаркет_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.ЯндексМаркет)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток,
	|	рар_мп_СопоставленныеСклады.рар_мп_ЯМ_campaignId КАК рар_мп_ЯМ_campaignId
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Артикул КАК Артикул,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара КАК SKUТовара
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВТ_Номенклатура.SKUТовара КАК SKUТовара,
	|	ВТ_АккаунтыИСклады.рар_мп_ЯМ_campaignId КАК рар_мп_ЯМ_campaignId
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.рар_мп_ЯМ_campaignId КАК Магазин,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.SKUТовара КАК SKUТовара,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.рар_мп_ЯМ_campaignId,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.Артикул,
	|	ВТ_Данные.SKUТовара,
	|	ВТ_Данные.Аккаунт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Магазин,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт,
	|	Магазин";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";
		
		ЗаписьЖурналаРегистрации("Передача остатков ЯндексМаркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
		
		Возврат;
		
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаСклад = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи    = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.Прямой);  
			ЛимитТовара               = 0;
			КоличествоСтрок           = 0; 
			МассивСтрокНоменклатуры   = Новый Массив;   
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЛимитТовара >= 100000 Тогда
					
					ВремяОжидания = 60;
							
					КонДата = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < КонДата Цикл
						
					КонецЦикла;
					
					ЛимитТовара = 0;   
					
				КонецЕсли;
				
				Если КоличествоСтрок >= 2000 Тогда      
					
					ОтветHTTP = рар_мп_ЯндексМаркет_Методы.Метод_ПередачаИнформацииОбОстатках(Выборка.Аккаунт, ВыборкаСклад.Магазин,
					МассивСтрокНоменклатуры);
					МассивСтрокНоменклатуры.Очистить(); 
					КоличествоСтрок = 0; 
						
					Если ОтветHTTP.КодСостояния <> 200 Тогда 
						
						Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.errors.Получить(0).message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

							Возврат;
							
						Иначе    
						
							Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

							Возврат;	
							
						КонецЕсли;
							
					КонецЕсли;   
				
				КонецЕсли;    
				
				СтруктураПолученныхЗначение = Новый Структура("SKUТовара, КоличествоОстаток, ВНаличии", ВыборкаДетальныеЗаписи.SKUТовара, 
																ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии);
				
				МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);
				ЛимитТовара     = ЛимитТовара + 1;
				КоличествоСтрок = КоличествоСтрок + 1; 
				
			КонецЦикла; 
			
			Если МассивСтрокНоменклатуры.Количество() > 0 Тогда
			    
				ОтветHTTP = рар_мп_ЯндексМаркет_Методы.Метод_ПередачаИнформацииОбОстатках(Выборка.Аккаунт, ВыборкаСклад.Магазин, 
																						  МассивСтрокНоменклатуры);
				Если ОтветHTTP.КодСостояния <> 200 Тогда 
						
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
					
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.errors.Получить(0).message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти  

#Область Ozon

Процедура Ozon_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.OZON)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_Ozon_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_Ozon_СопоставленныеТовары.IDТовара КАК IDТовара,
	|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_Ozon_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.IDТовара КАК IDТовара,
	|	ВТ_Номенклатура.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.IDТовара КАК IDТовара,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.IDТовара,
	|	ВТ_Данные.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	УникальныйИдентификаторСклада,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
						
			Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";
			
			ЗаписьЖурналаРегистрации("Передача остатков OZON", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
			
			Возврат;
			
	КонецЕсли;
		
	КоличествоЗапросов = 0;	
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоСтрок               = 0;
		ОбщееКоличествоТоваров        = 0;  
		МассивСтрокНоменклатуры       = Новый Массив;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ОбщееКоличествоТоваров >= 8000 Тогда 
				
				ВремяОжидания = 60;
							
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				ОбщееКоличествоТоваров = 0;
				
			КонецЕсли;
			
			Если КоличествоСтрок >= 100 Тогда     
				
				Если КоличествоЗапросов = 50 Тогда
					
					КоличествоЗапросов = 0;
					
					ВремяОжидания = 5;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
				
				КонецЕсли;
				
				ОтветHTTP = рар_мп_Ozon_Методы.Метод_ОбновитьКоличествоТоваровНаСкладах(Выборка.Аккаунт, МассивСтрокНоменклатуры);
				КоличествоЗапросов = КоличествоЗапросов + 1;
				КоличествоСтрок = 0;
				МассивСтрокНоменклатуры.Очистить(); 
					
				Если ОтветHTTP.КодСостояния <> 200 Тогда
					
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
		
				КонецЕсли; 
				
			КонецЕсли;
			
			СтруктураПолученныхЗначение = Новый Структура("Артикул, КоличествоОстаток, ВНаличии, IDТовара, УникальныйИдентификаторСклада", ВыборкаДетальныеЗаписи.Артикул, 
															ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии, ВыборкаДетальныеЗаписи.IDТовара, 
																												ВыборкаДетальныеЗаписи.УникальныйИдентификаторСклада);

			
			КоличествоСтрок        = КоличествоСтрок + 1;
			ОбщееКоличествоТоваров = ОбщееКоличествоТоваров + 1;
			МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);
			
		КонецЦикла; 
		
		Если МассивСтрокНоменклатуры.Количество() > 0 Тогда
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			ОтветHTTP = рар_мп_Ozon_Методы.Метод_ОбновитьКоличествоТоваровНаСкладах(Выборка.Аккаунт, МассивСтрокНоменклатуры);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
				
			Если ОтветHTTP.КодСостояния <> 200 Тогда
				
				Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
		
			КонецЕсли; 
							
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Wildberries

Процедура Wildberries_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Wildberries)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_Wildberries_СопоставленныеТовары.IDТовара КАК IDТовара,
	|	рар_мп_Wildberries_СопоставленныеТовары.Артикул КАК Артикул,
	|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_Wildberries_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.IDТовара КАК IDТовара,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВТ_Номенклатура.Баракод КАК Баракод
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Баракод КАК Баракод,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.Баракод,
	|	ВТ_Данные.Аккаунт
	|
	|УПОРЯДОЧИТЬ ПО
	|	УникальныйИдентификаторСклада,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт,
	|	УникальныйИдентификаторСклада";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
			
		Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";

		ЗаписьЖурналаРегистрации("Ошибка при формировании остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
			
		Возврат;			
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл     
		
		ВыборкаСклад = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаСклад.Следующий() Цикл 
			
			КоличествоСтрок               = 0;
			КоличествоЗапросов            = 0;  
			МассивСтрокНоменклатуры       = Новый Массив;
			
			ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
				
				Если КоличествоЗапросов = 300 Тогда
					
					ВремяОжидания = 60;
							
					КонДата = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < КонДата Цикл
						
					КонецЦикла;
					
					КоличествоЗапросов = 0; 
					
				КонецЕсли;
				
				Если КоличествоСтрок >= 1000 Тогда 
					
					ОтветHTTP = рар_мп_Wildberries_Методы.Метод_ОбновитьОстаткиТоваров(Выборка.Аккаунт, ВыборкаСклад.УникальныйИдентификаторСклада, МассивСтрокНоменклатуры); 
					
					МассивСтрокНоменклатуры.Очистить();
						
					КоличествоСтрок = 0; 
					
					КоличествоЗапросов = КоличествоЗапросов + 1;
					
					Если ОтветHTTP.КодСостояния <> 204 Тогда 
						
						Если ОтветHTTP.Свойство("ОтветAPI") Тогда
							
							Если ОтветHTTP.КодСостояния = 401 или ОтветHTTP.КодСостояния = 429 Тогда 
								
								Ошибка = ОтветHTTP.ОтветAPI.statusText; 
								
							ИначеЕсли ОтветHTTP.КодСостояния = 409 Тогда
								
								Ошибка = ОтветHTTP.ОтветAPI.Получить(0).message;
								
							Иначе     
								
								Ошибка = ОтветHTTP.ОтветAPI.message;
								
							КонецЕсли;
						
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

							Возврат;
							
						Иначе    
						
							Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

							Возврат;	
							
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;  
				
			    СтруктураПолученныхЗначение = Новый Структура("Баракод, КоличествоОстаток, ВНаличии", ВыборкаДетальныеЗаписи.Баракод, 
											ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии);	
					
			    КоличествоСтрок = КоличествоСтрок + 1;
				МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);   

			КонецЦикла; 
			
			Если МассивСтрокНоменклатуры.Количество() > 0 Тогда 
				
				ОтветHTTP = рар_мп_Wildberries_Методы.Метод_ОбновитьОстаткиТоваров(Выборка.Аккаунт, ВыборкаСклад.УникальныйИдентификаторСклада, МассивСтрокНоменклатуры);
					
				МассивСтрокНоменклатуры.Очистить();
						
				КоличествоСтрок = 0;
				
				Если ОтветHTTP.КодСостояния <> 204 Тогда 
					
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Если ОтветHTTP.КодСостояния = 401 или ОтветHTTP.КодСостояния = 429 Тогда 
							
							Ошибка = ОтветHTTP.ОтветAPI.statusText; 
							
						ИначеЕсли ОтветHTTP.КодСостояния = 409 Тогда
							
							Ошибка = ОтветHTTP.ОтветAPI.Получить(0).message;
							
						Иначе     
							
							Ошибка = ОтветHTTP.ОтветAPI.message;
							
						КонецЕсли;
					
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
						
				КонецЕсли;
						
			КонецЕсли;  
			
		КонецЦикла; 
	КонецЦикла;
		
КонецПроцедуры      

#КонецОбласти
